app/views/projects/_tasks.html.erb

						<!-- <div class="page-header">
							<h1><small class="pull-right"><%#= task.comments.count%> comments</small> Comments </h1>
---
SELECT "comments".* FROM "comments" WHERE "comments"."task_id" = ?  [["task_id", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."task_id" = ?  [["task_id", 26]]

	// $(document).unbind('click',".tasks",function(){
		$( document ).ready(function() {

		$(".tasks").unbind().click(function() {
  var tid = $(this).attr('taskid')
		$('.task-'+tid+'-comments').toggleClass('hide')
});});
---
UPDATE "tasks" SET "title" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["title", "Task 1 up"], ["updated_at", "2018-06-16 07:32:29.784574"], ["id", 1]]