app/views/projects/create_comment.js.erb

$(".task-<%=@task.id%>-comments").find('.comments-form').html("<%= j render '/projects/comment_form', comment: @task.comments.new, url: create_task_comment_path(id: @project.id, tid: @task.id), remote: true, class: 'btn btn-primary'%>")
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."project_id" = ? AND "tasks"."id" = ? LIMIT ?  [["project_id", 1], ["id", 1], ["LIMIT", 1]]