app/controllers/projects_controller.rb

SELECT  "projects".* FROM "projects" WHERE "projects"."user_id" = ? AND "projects"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
---
  def index
    @projects = current_user.projects.all

INSERT INTO "projects" ("title", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "t1"], ["description", "t1"], ["user_id", 2], ["created_at", "2018-06-16 08:46:42.137696"], ["updated_at", "2018-06-16 08:46:42.137696"]]
---
  def create
    @project = current_user.projects.new(project_params)
    respond_to do |format|
      if @project.save

UPDATE "projects" SET "description" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["description", "sdfsdfdfsdf"], ["updated_at", "2018-06-16 08:29:07.419841"], ["id", 8]]
---
  def update
    respond_to do |format|
      if @project.update(project_params)

DELETE FROM "projects" WHERE "projects"."id" = ?  [["id", 8]]
---
  def destroy
    @project.destroy

INSERT INTO "tasks" ("project_id", "title", "due_on", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["project_id", 9], ["title", "xczcz"], ["due_on", "2018-12-06 00:00:00"], ["created_at", "2018-06-16 08:59:25.213363"], ["updated_at", "2018-06-16 08:59:25.213363"]]
---
  def create_task
    @task = @project.tasks.new(task_params)
    respond_to do |format|
      if @task.save

UPDATE "tasks" SET "title" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["title", "Task 1 up"], ["updated_at", "2018-06-16 07:32:29.784574"], ["id", 1]]
---
  def update_task
     respond_to do |format|
      if @task.update(task_params)

DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 3]]
---
  def destroy_task
     @task.destroy

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 42], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 42]]
---
  def destroy_comment
    @comment = Comment.find(params[:id])
     @comment.destroy

INSERT INTO "comments" ("task_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["task_id", 27], ["content", "asAS"], ["created_at", "2018-06-16 11:31:31.988347"], ["updated_at", "2018-06-16 11:31:31.988347"]]
---
  def create_comment
    @comment = @task.comments.new(comment_params)
    respond_to do |format|
      if @comment.save

UPDATE "tasks" SET "is_done" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["is_done", 0], ["updated_at", "2018-06-16 10:39:20.413201"], ["id", 26]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."project_id" = ? AND "tasks"."id" = ? LIMIT ?  [["project_id", 9], ["id", 4], ["LIMIT", 1]]
---
  def change_task_status
    Task.find(params[:task_id]).update(is_done:params[:value])

SELECT  "projects".* FROM "projects" WHERE "projects"."user_id" = ? AND "projects"."id" = ? LIMIT ?  [["user_id", 2], ["id", 9], ["LIMIT", 1]]
---
    def set_project
      @project = current_user.projects.find_by(id: params[:id])

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."project_id" = ? AND "tasks"."id" = ? LIMIT ?  [["project_id", 9], ["id", 27], ["LIMIT", 1]]
---
    def set_task
      @task = @project.tasks.find_by(id: params[:tid])